adpyke.vscode-sql-formatter
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
eamodio.gitlens
EditorConfig.EditorConfig
esbenp.prettier-vscode
GitHub.copilot
ivan-bocharov.stan-vscode
mechatroner.rainbow-csv
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
njpwerner.autodocstring
oderwat.indent-rainbow
PKief.material-icon-theme
redhat.vscode-yaml
streetsidesoftware.code-spell-checker
TabNine.tabnine-vscode
usernamehw.errorlens
VisualStudioExptTeam.vscodeintellicode
wayou.vscode-todo-highlight
zhuangtongfa.material-theme
