adpyke.vscode-sql-formatter
bierner.markdown-mermaid
charliermarsh.ruff
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
eamodio.gitlens
editorconfig.editorconfig
esbenp.prettier-vscode
firefox-devtools.vscode-firefox-debug
foxundermoon.shell-format
github.copilot
github.copilot-chat
github.vscode-pull-request-github
golang.go
hashicorp.terraform
ivan-bocharov.stan-vscode
lokalise.i18n-ally
mechatroner.rainbow-csv
ms-azuretools.vscode-bicep
ms-azuretools.vscode-docker
ms-dotnettools.vscode-dotnet-runtime
ms-python.black-formatter
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
mtxr.sqltools
mtxr.sqltools-driver-pg
naumovs.color-highlight
njpwerner.autodocstring
oderwat.indent-rainbow
orta.vscode-jest
pkief.material-icon-theme
redhat.java
redhat.vscode-yaml
rust-lang.rust-analyzer
sonarsource.sonarlint-vscode
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
usernamehw.errorlens
vadimcn.vscode-lldb
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
wayou.vscode-todo-highlight
yinfei.luahelper
yzane.markdown-pdf
zhuangtongfa.material-theme
