adpyke.vscode-sql-formatter
charliermarsh.ruff
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
eamodio.gitlens
EditorConfig.EditorConfig
esbenp.prettier-vscode
foxundermoon.shell-format
GitHub.copilot
GitHub.copilot-chat
GitHub.copilot-labs
GitHub.vscode-pull-request-github
golang.go
hashicorp.terraform
ivan-bocharov.stan-vscode
lokalise.i18n-ally
mechatroner.rainbow-csv
ms-azuretools.vscode-bicep
ms-azuretools.vscode-docker
ms-dotnettools.vscode-dotnet-runtime
ms-python.black-formatter
ms-python.mypy-type-checker
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode.makefile-tools
njpwerner.autodocstring
oderwat.indent-rainbow
Orta.vscode-jest
PKief.material-icon-theme
redhat.java
redhat.vscode-yaml
rust-lang.rust-analyzer
SonarSource.sonarlint-vscode
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
usernamehw.errorlens
vadimcn.vscode-lldb
VisualStudioExptTeam.intellicode-api-usage-examples
VisualStudioExptTeam.vscodeintellicode
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
wayou.vscode-todo-highlight
yinfei.luahelper
zhuangtongfa.material-theme
